Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetBoundary
Gets the collection of polygons that form the 2D boundary.
This method returns a collection of polyloops (planar
polygons) that defines an enclosed area measured by
interior bounding surfaces.
Returns:
The collection of polygons that form the 2D boundary.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetClosedShell
Gets the collection of polygons that form a closed shell.
This method returns a collection of polyloops (planar
polygons) that defines an enclosed volume measured by
interior bounding surfaces.
Returns:
the collection of polygons that form a closed shell.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.GetAnalyticalSurfaces
Provides a way to access the collection of
analytical surfaces for a space.
Geometry data defining an analytical space volume.
Through an analytical surface you can connect a
source element with each polygon in a space.
The analytical surfaces defines an enclosed volume
bounded by the center plane of walls
and the top plane of roofs and floors.
Returns:
the collection of analytical surfaces for a space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.CADObjectUniqueId
The unique id of the originating CAD object (model element) associated with this space.
Remarks:
This id can be passed to obtain the element from Document.Element[string] property, but any element obtained through this method
may no longer point to a valid or up-to-date model element. The originating CAD object is only accurate and up-to-date at the time of creation of the energy model.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.ComposedName
The composed name for this space.
Remarks:
This value is composed of the name and description attributes,
separated by a space.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Description
The description.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.SpaceName
The name.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.InnerVolume
The analytical volume for this space.
Remarks:
The inner space volume is bounded by the interior surfaces.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.AnalyticalVolume
The volume for this space.
Remarks:
The analytical space volume is bounded by the center plane
of walls and the top plane of roofs and floors.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.Area
The area for this space.
Remarks:
This value is the enclosed area measured by interior bounding surfaces.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace
Analytical space.
Since:
2012